aozima/stm32_radio/trunk/stm32radio/remote.c
/*
+----------------------------------------------------
|
| 红外自学习遥控
|
| Chang Logs:
| Date           Author       Notes
| 2010-01-02     aozima       The bate version.
| 2010-02-10     aozima       change printf string 中文 to english.
| 2010-03-25     aozima       add remote_fn define.
| 2010-06-16     aozima       add remote_study to ui.
+----------------------------------------------------
*/

#include <stdio.h>
#include <string.h>
#include <rtthread.h>
#include <dfs_posix.h>
#include <stm32f10x.h>

#include <rtgui/event.h>
#include <rtgui/rtgui_server.h>

/* 重定义printf */
#define printf                   rt_kprintf
/* 设置允许偏差,单位0.01ms */
#define remote_deviation         15
#define remote_code_len_max      100
/* 样本保存文件名全路径 */
#define remote_fn                "/resource/remote.txt"

/* 红外模式 0:没启动,1:自学习,2:正常解码 */
typedef enum
{
    remote_mode_disable,
    remote_mode_study,
    remote_mode_enable,
}remote_mode_type;
remote_mode_type rem_mode = remote_mode_disable;

static unsigned int first_tick = 0;    /* 本次开始捕获的时间戳 */
static unsigned int rx_count   = 0;    /* 本次捕获中捕获到的信号计数. */
static unsigned short * rm_code = RT_NULL;

/* 信号量对象*/
static struct rt_semaphore sem_IR;

struct rem_codes_typedef
{
    unsigned int len;
    unsigned short rem_code[remote_code_len_max];
};
struct rem_codes_typedef * p_rem_code_src = RT_NULL;

static const char  str1[]="KEY_UP";     /* 上 */
static const char  str2[]="KEY_DOWN";   /* 下 */
static const char  str3[]="KEY_LEFT";   /* 左 */
static const char  str4[]="KEY_RIGHT";  /* 右 */
static const char  str5[]="KEY_ENTER";  /* 确认 */
static const char  str6[]="KEY_RETURN"; /* 返回 */
static const char * desc_key[6]= {str1,str2,str3,str4,str5,str6};

/* 将数据转换成 #####\r\n 格式的文本 */
static void dectoascii(unsigned int date_input,char * p)
{
    p[0] = date_input / 10000 +'0';
    date_input = date_input % 10000;
    p[1] = date_input / 1000  +'0';
    date_input = date_input % 1000;
    p[2] = date_input / 100   +'0';
    date_input = date_input % 100;
    p[3] = date_input / 10    +'0';
    date_input = date_input % 10;
    p[4] = date_input        +'0';
    date_input = 0;
    p[5] = '\r';
    p[6] = '\n';
    p += 7;
}
/* 将#####\r\n 格式文本转换成数据 */
static unsigned short asciitodec(const char * p_str)
{
    return  ( (p_str[0]-'0')*10000
              + (p_str[1]-'0')*1000
              + (p_str[2]-'0')*100
              + (p_str[3]-'0')*10
              + (p_str[4]-'0') );
}

/* tim5 configure */
static void TIM5_Configuration(void)
{
    /* 时钟及分频设置 */
    {
        TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
        /* Time Base configuration */
        /* 72M/720 = 0.01ms */
        TIM_TimeBaseStructure.TIM_Prescaler = 720-1;
        //计数模式:向上计数
        TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
        TIM_TimeBaseStructure.TIM_Period = 0xFFFF;
        TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
        //重新计数的起始值
        TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;

        TIM_TimeBaseInit(TIM5, &TIM_TimeBaseStructure);
    }

    /* 捕获设置 */
    {
        TIM_ICInitTypeDef  TIM_ICInitStructure;

        TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;/* 每次检测到捕获输入就触发一次捕获 */
        TIM_ICInitStructure.TIM_ICFilter    = 8;/* 滤波 */

        TIM_ICInitStructure.TIM_Channel     = TIM_Channel_3;//选择通道3
        TIM_ICInitStructure.TIM_ICPolarity  = TIM_ICPolarity_Falling;//下降沿
        TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;//通道方向选择
        TIM_ICInit(TIM5, &TIM_ICInitStructure);

        TIM_ICInitStructure.TIM_Channel     = TIM_Channel_4;//选择通道3
        TIM_ICInitStructure.TIM_ICPolarity  = TIM_ICPolarity_Rising;//上升沿
        TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_IndirectTI;//通道方向选择
        TIM_ICInit(TIM5, &TIM_ICInitStructure);
    }

    /* 输入触发源选择:外部输入触发 */
    TIM_SelectInputTrigger(TIM5, TIM_TS_ETRF);//TIM_TS_ETRF 外部触发
    /* 从模式-复位模式 */
    /* TIM_SlaveMode_Reset 4:选中的触发输入(TRGI)的上升沿重新初始化计数器，并且产生一个更新寄存器的信号 */
    TIM_SelectSlaveMode(TIM5, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(TIM5, TIM_MasterSlaveMode_Enable);

    /* TIM enable counter */
    TIM_Cmd(TIM5, ENABLE);

    /* Enable the CC3 and CC4 Interrupt Request */
    TIM_ITConfig(TIM5, TIM_IT_CC3, ENABLE);
    TIM_ITConfig(TIM5, TIM_IT_CC4, ENABLE);
}

static void NVIC_Configuration(void)
{
    NVIC_InitTypeDef NVIC_InitStructure;

    /* Enable the TIM5 global Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = TIM5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

static void RCC_Configuration(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);

    /* TIM5 clock enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);

    /* clock enable */
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA ,ENABLE);
}

static void GPIO_Configuration(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    /* TIM5 channel 3 pin (PA.02) configuration */
    GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;

    GPIO_Init(GPIOA, &GPIO_InitStructure);
}

void rem_start(void)
{
    RCC_Configuration();
    GPIO_Configuration();

    /* configure TIM5 for remote and encoder */
    NVIC_Configuration();
    TIM5_Configuration();

    p_rem_code_src = rt_malloc( sizeof(struct rem_codes_typedef)*6 );
    if( p_rem_code_src != RT_NULL)
    {
        rt_memset(p_rem_code_src,0, sizeof(struct rem_codes_typedef)*6 );

        /* 解读红外信息 */
        {
            int fd,size;
            char buf[7];/* 文件读取临时缓存 #####\r\n */
            unsigned int i;
            unsigned short tmp;
            unsigned int read_index = 0;
            unsigned int EOF_flag = 1;

            printf("\r\ndecode remote codes");
            fd = open(remote_fn,O_RDONLY,0);
            if( fd >= 0 )
            {
                printf("\r/resource/remote.txt open succeed.\r\n");
                while( EOF_flag )
                {
                    /* 读取长度 */
                    size = read(fd,buf,7);
                    if( (size == 7) && (buf[5]=='\r') && buf[6]=='\n' )
                    {
                        /* 转换得到样本数据长度 */
                        tmp = asciitodec(buf);
                        if( tmp<100 )
                        {
                            unsigned int code_len = tmp;
                            p_rem_code_src[read_index].len = code_len;

