aozima/stm32_radio/trunk/stm32radio/remote.c
                            /* 如果样本长度符合 就开始从文件读取编码数据 */
                            for(i=0; i<code_len; i++)
                            {
                                size = read(fd,buf,7);
                                if( (size == 7) && (buf[5]=='\r') && buf[6]=='\n' )
                                {
                                    /* 转换得到样本数据 */
                                    tmp = asciitodec(buf);
                                    p_rem_code_src[read_index].rem_code[i] = tmp;
                                }
                            }
                            read_index++;
                        }
                    }
                    else
                    {
                        EOF_flag = 0;
                    }
                }//while( EOF_flag )

                /* 判断是否正确解读编码数据文件 */
                if ( p_rem_code_src[0].len > 0 && p_rem_code_src[0].len < remote_code_len_max )
                {
                    /* 设置工作模式为正常识别模式 */
                    rem_mode = remote_mode_enable;
                    printf("\r\ndecode succeed,The remote enable\r\n");
                }
                else
                {
                    /* 设置工作模式为关闭模式 */
                    rem_mode = remote_mode_disable;
                    printf("\r\nrem_codes decode fail,The remote disable\r\n");
                }
            }
            else
            {
                printf("\rrem_codes /resource/remote.txt open fail! fd:%d\r\nThe remote disbale.\r\nplease run rem_study()\r\n",fd);
            }
            close(fd);
        }/* 解读红外信息 */

    }
    else
    {
        rem_mode = remote_mode_disable;
        printf("\r\nmalloc rem_codes[] fail!!!\r\nThe remote disable!");
    }
}

void rem_encoder(struct rtgui_event_kbd * p_kbd_event)
{
    /* 检查是否有数据被捕获 */
    if( (rem_mode==2) && (rx_count > 0) )
    {
        /* 手动清零第一个捕获结果 */
        rm_code[0] = 0;
        rx_count = 0;

        /* 匹配捕获的数据 */
        {
            unsigned int tmp;
            unsigned int err_flag = 0;
            unsigned int rem_cmp_n = 6;

            /* 循环匹配所有KEY */
            while( rem_cmp_n )
            {
                unsigned int tmp2 = p_rem_code_src[ 6-rem_cmp_n ].len;
                //printf("\r\nrem_cmp_n:%d  tmp2:%d",rem_cmp_n,tmp2);
                if( tmp2 )
                {

                    for(tmp=0; tmp<tmp2; tmp++)
                    {
                        /* 判断捕获结果是否在偏差允许范围内 */
                        if( !( (rm_code[tmp] < p_rem_code_src[6-rem_cmp_n].rem_code[tmp]+remote_deviation)
                                && (rm_code[tmp] > p_rem_code_src[6-rem_cmp_n].rem_code[tmp]-remote_deviation)) )
                        {
                            err_flag = 1;
                        }
                    }
                }
                else
                {
                    err_flag = 1;
                    printf("\r\nThe rem codes len is 0.");
                }

                if( err_flag==0 )
                {
                    /* 对比全部数据符合 */
                    printf("\r\nmatch key: %s",desc_key[6-rem_cmp_n]);
                    switch( rem_cmp_n )
                    {
                    case 6:
                        p_kbd_event->key  = RTGUIK_UP;
                        break;
                    case 5:
                        p_kbd_event->key  = RTGUIK_DOWN;
                        break;
                    case 4:
                        p_kbd_event->key  = RTGUIK_LEFT;
                        break;
                    case 3:
                        p_kbd_event->key  = RTGUIK_RIGHT;
                        break;
                    case 2:
                        p_kbd_event->key  = RTGUIK_RETURN;
                        break;
                    case 1:
                        p_kbd_event->key  = RTGUIK_HOME;
                        break;
                    default:
                        break;
                    }
                    rem_cmp_n = 0;
                }
                else
                {
                    /* 对比不符合,清零错误标致,以进行下一次对比 */
                    err_flag = 0;
                    rem_cmp_n --;
                }

            }
        }
    }/* 红外遥控匹配 */
}

/* remote isr */
void remote_isr(void)
{
    static unsigned int clr_flag = 1;      /* 是否需要清零标致,用来判断是否是某次捕获的起点. */
    unsigned int tick_now  = rt_tick_get();/* 获取当前时间戳.*/

    /* 红外遥控下降沿 */
    if(TIM_GetITStatus(TIM5, TIM_IT_CC3) == SET)
    {
        switch( rem_mode )
        {
        case 0:/* 未启动 */
            break;
        case 1:/* 自学习 */
            /* 如果总的接收计数为0,则判定这是一次开始,需要清零. */
            if( rx_count==0 )
            {
                //需要清0
                clr_flag = 1;
            }
            if( rx_count < remote_code_len_max )
            {
                rm_code[rx_count++] = TIM_GetCapture3(TIM5);
            }
            break;
        case 2://正常解码
            if( ( rx_count>(remote_code_len_max-10) ) || tick_now>first_tick+10 )
            {
                rx_count = 0;
                clr_flag = 1;
            }
            if(rx_count < remote_code_len_max )
            {
                rm_code[rx_count++] = TIM_GetCapture3(TIM5);
            }
            break;
        default:
            rem_mode = remote_mode_disable;/* 异常跳入,则关闭红外摇控 */
            break;
        }
        TIM_ClearITPendingBit(TIM5, TIM_IT_CC3);
    }

    /* 红外遥控上升沿 */
    if(TIM_GetITStatus(TIM5, TIM_IT_CC4) == SET)
    {
        switch( rem_mode )
        {
        case 0://未启动
            break;
        case 1://自学习
            if( rx_count < remote_code_len_max )
            {
                rm_code[rx_count++] = TIM_GetCapture4(TIM5);
            }
            break;
        case 2://正常解码
            if( rx_count < remote_code_len_max )
            {
                rm_code[rx_count++] = TIM_GetCapture4(TIM5);
                if( p_rem_code_src[0].len == rx_count)
                {
                    rt_sem_release(&sem_IR);
                }
            }
            break;
        default:
            rem_mode = remote_mode_disable;/* 异常跳入,则关闭红外摇控 */
            break;
        }
        TIM_ClearITPendingBit(TIM5, TIM_IT_CC4);
    }

    /* 更新时间戳 */
    first_tick = tick_now;
    /* 检测是否需要重置计数器 */
    if( clr_flag )
    {
        /* 重置计数器 */
        TIM_SetCounter(TIM5,0);
        clr_flag = 0;
    }
}

#include <rtgui/rtgui.h>
#include <rtgui/rtgui_system.h>
#include <rtgui/widgets/workbench.h>
#include <rtgui/widgets/view.h>

