aozima/stm32_radio/trunk/stm32radio/remote.c
#include "player_bg.h"

static rtgui_view_t*           setting_view  = RT_NULL;
static rtgui_workbench_t* father_workbench   = RT_NULL;

/* 启动红外学习程序 */
void remote_study_thread_entry(void * parameter)
{
    struct rtgui_event_command ecmd;

    unsigned int i;

    int fd,size;
    char * tmp_buf = RT_NULL;

    tmp_buf = rt_malloc( (remote_code_len_max+1)*7 );
    if(tmp_buf == RT_NULL) return;

    RTGUI_EVENT_COMMAND_INIT(&ecmd);
    ecmd.type = RTGUI_EVENT_PAINT;

    rem_mode = remote_mode_study;
    rx_count = 0;
    printf("\r\nremote studing.....");
    fd = open(remote_fn,O_WRONLY | O_TRUNC,0);
    if( fd >= 0 )
    {
        printf("\r\n/resource/remote.txt create succeed.");
    }
    else
    {
        printf("\r/resource/remote.txt create fail.\r\nabort.");
        return;
    }

    /* 学习6个键盘 */
    for( i=0; i<6; i++)
    {
        unsigned int is_ok = 1;
        memset(rm_code,0,sizeof(rm_code));
        printf("\r\npress key %s",desc_key[i]);

        //向UI发送消息
        ecmd.command_id = PLAYER_REQUEST_REMOTE;
        strncpy(ecmd.command_string,desc_key[i],RTGUI_NAME_MAX);
        rtgui_thread_send(rt_thread_find("ply_ui"), &ecmd.parent, sizeof(ecmd));

        while( is_ok==1 )
        {
            /* 如果在200ms内有捕获到数据. */
            if( ( rem_mode== remote_mode_study ) && (rt_tick_get()>first_tick+20) && (rx_count > 0) )
            {
                unsigned int a,rx_count_current;
                char * p = tmp_buf;

                printf("\r\n%s",desc_key[i]);

                printf("  rx_count : %d",rx_count);

                rm_code[0] = 0;

                /* 从捕获到的数据中取得第一个有效段的长度. */
                {
                    unsigned int i = 0;
                    rx_count_current = 0;
                    while( rx_count_current==0 )
                    {
                        /* 如果此点距离下点小于20ms,且下点不为0,则认为有效. */
                        if( ((rm_code[i]+2000)>rm_code[i+1] ) && (rm_code[i+1] != 0) )
                        {
                            i++;
                        }
                        else /* 否则就是无效.*/
                        {
                            /* 获得本次捕获的有效记录数. */
                            rx_count_current = i+1;
                        }
                    }
                    printf("  rx_count_current : %d",rx_count_current);
                }
                p_rem_code_src[i].len = rx_count_current;

                /* TIM disable counter */
                TIM_Cmd(TIM5, DISABLE);
                /* disable the CC3 and CC4 Interrupt Request */
                TIM_ITConfig(TIM5, TIM_IT_CC3, DISABLE);
                TIM_ITConfig(TIM5, TIM_IT_CC4, DISABLE);

                /* 把本次捕获的有效记录数转换成十进制ASCII保存. */
                dectoascii(rx_count_current,p);
                p += 7;

                for( a=0; a<rx_count_current; a++)
                {
                    /* 把当前数据直接写进样品数据 */
                    p_rem_code_src[i].rem_code[a] = rm_code[a];
                    /* 然后转换成文本格式 #####\r\n */
                    dectoascii(rm_code[a],p);
                    p += 7;
                }
                size = write(fd,(char*)tmp_buf,(rx_count_current+1)*7 );
                if( size==((rx_count_current+1)*7) )
                {
                    printf(" file write succeed!");
                    is_ok++;
                    rt_thread_delay( 2 );

                    rx_count = 0;//清零接收计数,以便进行再次捕获

                    /* 重新打开 TIM5 进行捕获 */
                    TIM_ClearITPendingBit(TIM5, TIM_IT_CC3);
                    TIM_ClearITPendingBit(TIM5, TIM_IT_CC4);
                    /* TIM ENABLE counter */
                    TIM_Cmd(TIM5, ENABLE);
                    /* ENABLE the CC3 and CC4 Interrupt Request */
                    TIM_ITConfig(TIM5, TIM_IT_CC3, ENABLE);
                    TIM_ITConfig(TIM5, TIM_IT_CC4, ENABLE);
                }
                else
                {
                    printf(" file write fail.\r\nabort.");
                    return;
                }
            }
            rt_thread_delay(1);
        }//while( is_ok==1 )
    }//for( i=0; i<6; i++)
    close(fd);
    printf("\r\nremote study complete.The remote enable.\r\n");

    strcpy(ecmd.command_string,"done");
    rtgui_thread_send(rt_thread_find("ply_ui"), &ecmd.parent, sizeof(ecmd));
    rt_thread_delay(RT_TICK_PER_SECOND);
    strcpy(ecmd.command_string,"exit");
    rtgui_thread_send(rt_thread_find("ply_ui"), &ecmd.parent, sizeof(ecmd));

    rem_mode = remote_mode_enable;

    rt_free(tmp_buf);
    return;
}


static unsigned int yy2 = 0;
static rt_bool_t view_event_handler ( struct rtgui_widget* widget, struct rtgui_event* event )
{
    switch ( event->type )
    {
    case RTGUI_EVENT_PAINT:
    {
        struct rtgui_dc* dc;
        struct rtgui_rect rect;
        char* line;

        line = rtgui_malloc(256);

        //开始绘图
        dc = rtgui_dc_begin_drawing ( widget );

        if ( dc == RT_NULL )
            return RT_FALSE;

        //得到位置
        rtgui_widget_get_rect ( widget, &rect );

        /* fill background */
        rtgui_dc_fill_rect(dc, &rect);

        rect.y2 = rect.y1 + 18;
        yy2 = rect.y2;

        sprintf(line, "红外遥控学习程序");
        rtgui_dc_draw_text(dc, line, &rect);

        rect.y1 = rect.y2;
        rect.y2 = rect.y1 + 18;
        yy2 = rect.y2;

        sprintf(line, "长按ENTER键返回");
        rtgui_dc_draw_text(dc, line, &rect);

        rtgui_dc_end_drawing ( dc );
        rtgui_free(line);

        return RT_FALSE;
    }
    case RTGUI_EVENT_COMMAND:
    {
        struct rtgui_dc* dc;
        struct rtgui_rect rect;
        char* line;

        struct rtgui_event_command* ecmd = (struct rtgui_event_command*)event;
//        rt_kprintf("cmd type:%d cmd id:%d cmd_str: %s",ecmd->type,ecmd->command_id,ecmd->command_string);
        if( (strcmp(ecmd->command_string,"done")==0) || (strcmp(ecmd->command_string,"exit")==0))
        {
            if( strcmp(ecmd->command_string,"done")==0 )
            {
                line = rtgui_malloc(256);
                dc = rtgui_dc_begin_drawing ( widget );
                rtgui_widget_get_rect ( widget, &rect );
                rect.y1 = yy2;
                rect.y2 = rect.y1 + 18;
                yy2 = rect.y2;
                sprintf(line, "红外学习完成,已打开遥控功能");
                rtgui_dc_draw_text(dc, line, &rect);
                rtgui_dc_end_drawing ( dc );
                rtgui_free(line);
            }
            else
            {
                rtgui_workbench_t* workbench;

                workbench = RTGUI_WORKBENCH ( RTGUI_WIDGET ( setting_view )->parent );
                rtgui_workbench_remove_view ( workbench, setting_view );

                rtgui_view_destroy ( setting_view );
                setting_view = RT_NULL;
                return RT_TRUE;
            }
        }
        else
        {
            line = rtgui_malloc(256);
            dc = rtgui_dc_begin_drawing ( widget );
            rtgui_widget_get_rect ( widget, &rect );
            rect.y1 = yy2;
            rect.y2 = rect.y1 + 18;
            yy2 = rect.y2;

            sprintf(line, "请按键:%s",ecmd->command_string);
            rtgui_dc_draw_text(dc, line, &rect);
            rtgui_dc_end_drawing ( dc );
            rtgui_free(line);

            return RT_TRUE;
        }

