aozima/stm32_radio/trunk/stm32radio/remote.c
    }
    case RTGUI_EVENT_KBD:
    {
        struct rtgui_event_kbd* ekbd;

        ekbd = ( struct rtgui_event_kbd* ) event;

        if ( ekbd->type == RTGUI_KEYDOWN && ekbd->key == RTGUIK_RETURN )
        {
            rtgui_workbench_t* workbench;

            workbench = RTGUI_WORKBENCH ( RTGUI_WIDGET ( setting_view )->parent );
            rtgui_workbench_remove_view ( workbench, setting_view );

            rtgui_view_destroy ( setting_view );
            setting_view = RT_NULL;
            return RT_TRUE;
        }
        return RT_FALSE;
    }
    }
    return rtgui_view_event_handler ( widget, event );
}

void remote_study_ui(rtgui_workbench_t* workbench)
{
    father_workbench = workbench;

    setting_view = rtgui_view_create ( "setting_view" );
    /* 指定视图的背景色 */
    RTGUI_WIDGET_BACKGROUND ( RTGUI_WIDGET ( setting_view ) ) = green;
    /* this view can be focused */
    RTGUI_WIDGET ( setting_view )->flag |= RTGUI_WIDGET_FLAG_FOCUSABLE;

    //设置服务函数
    rtgui_widget_set_event_handler ( RTGUI_WIDGET ( setting_view ), view_event_handler );

    /* 添加到父workbench中 */
    rtgui_workbench_add_view ( father_workbench, setting_view );
    /* 非模式方式显示视图 */
    rtgui_view_show ( setting_view, RT_FALSE );

    //启动学习线程
    {
        rt_thread_t remote_study_thread;
        remote_study_thread = rt_thread_create("rm_study",
                                               remote_study_thread_entry, RT_NULL,
                                               2048, 30, 2);
        if (remote_study_thread != RT_NULL)rt_thread_startup(remote_study_thread);
    }
}

static struct rtgui_event_kbd kbd_event;
static void remote_thread_entry(void *parameter)
{
    /* init keyboard event */
    RTGUI_EVENT_KBD_INIT(&kbd_event);
    kbd_event.mod  = RTGUI_KMOD_NONE;
    kbd_event.unicode = 0;

    while(1)
    {
        /* 等待信号量,信号量在捕获到一定的数据后被释放 */
        if (rt_sem_take(&sem_IR,RT_WAITING_FOREVER) == RT_EOK)
        {
            kbd_event.key = RTGUIK_UNKNOWN;
            if( rem_mode == 2)
            {
                rem_encoder(&kbd_event);
            }
            if( kbd_event.key != RTGUIK_UNKNOWN)
            {
                kbd_event.type = RTGUI_KEYDOWN;
                /* post down event */
                rtgui_server_post_event(&(kbd_event.parent), sizeof(kbd_event));
                rt_thread_delay(20);

                /* post up event */
                kbd_event.type = RTGUI_KEYUP;
                rtgui_server_post_event(&(kbd_event.parent), sizeof(kbd_event));
            }
        }
    }
}

void remote_init(void)
{
    rt_thread_t remote_thread;

    rm_code = rt_malloc( remote_code_len_max*2 );
    if (rm_code == RT_NULL) return;

    rt_sem_init(&sem_IR,"sem_IR", 0,RT_IPC_FLAG_FIFO);

    rem_start();

    remote_thread = rt_thread_create("remote",
                                     remote_thread_entry, RT_NULL,
                                     384, 30, 2);
    if (remote_thread != RT_NULL)rt_thread_startup(remote_thread);
}
